Revit 2023 API
GroupTypeId.RailingSystemFamilyTopRail Property
 "Top Rail"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId RailingSystemFamilyTopRail { get; }
Visual Basic
Public Shared ReadOnly Property RailingSystemFamilyTopRail As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RailingSystemFamilyTopRail {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace